app/Controllers/Auth.php

INSERT INTO `tbl_log` (`idUser`, `ipAddress`, `device`, `status`, `terdaftar`) VALUES ('1', '::1', 'Chrome 128.0.0.0', 'Login', '2024-09-19 10:57:16')
---
                    'status' => 'Login',
                    'terdaftar' => date('Y-m-d H:i:s'),
                ];
                $this->LogModel->save($logData);

INSERT INTO `tbl_log` (`idUser`, `ipAddress`, `device`, `status`, `terdaftar`) VALUES ('1', '::1', 'Chrome 128.0.0.0', 'Logout', '2024-09-19 10:59:51')
---
    public function Logout()
    {
        $userId = session()->get('id'); // Ambil ID user dari sesi
        if ($userId) {
            $ipAddress = $this->request->getIPAddress();
            $device = $this->request->getUserAgent()->getBrowser() . ' ' . $this->request->getUserAgent()->getVersion();
            $logData = [
                'idUser' => $userId,
                'ipAddress' => $ipAddress,
                'device' => $device,
                'status' => 'Logout',
                'terdaftar' => date('Y-m-d H:i:s'),
            ];
            $this->LogModel->save($logData);