app/Models/LogModel.php

    public function getAllLogs()
    {
        return $this->select('tbl_log.*, tbl_user.nama, tbl_user.level')
                    ->join('tbl_user', 'tbl_user.id = tbl_log.idUser', 'left') // Melakukan join dengan tabel user
                    ->orderBy('terdaftar', 'DESC') // Mengurutkan berdasarkan waktu terbaru
                    ->findAll();
---
SELECT `tbl_log`.*, `tbl_user`.`nama`, `tbl_user`.`level`
FROM `tbl_log`
LEFT JOIN `tbl_user` ON `tbl_user`.`id` = `tbl_log`.`idUser`
ORDER BY `terdaftar` DESC