app/Models/ModelTamu.php

SELECT *
FROM `tbl_tamu`
---
    public function AllData()
    {
        return $this->db->table('tbl_tamu')
            ->get()->getResultArray();

INSERT INTO `tbl_tamu` (`nama`, `no_telp`, `terdaftar`, `keperluan`, `instansi`, `jenis_kelamin`, `alamat`) VALUES ('rdfdsf', '32423423', '2024-09-19 10:56:43', 'dsdada', 'asdasdas', 'Perempuan', 'adasda')
---
    public function InsertData($data)
    {
        $this->db->table('tbl_tamu')->insert($data);

SELECT *
FROM `tbl_tamu`
WHERE `id` = '1'
---
    public function DetailData($id)
    {
        return $this->db->table('tbl_tamu')
            ->where('id', $id)
            ->get()->getRowArray();

UPDATE `tbl_tamu` SET `id` = '1', `nama` = 'fsdfsdfa', `jenis_kelamin` = 'Laki - Laki', `instansi` = 'dasdasda', `no_telp` = '43', `alamat` = 'dsadasdadas', `keperluan` = 'dasdasda', `terdaftar` = '2024-09-19 10:58:07'
WHERE `id` = '1'
---
    public function UpdateData($data)
    {
        $this->db->table('tbl_tamu')->where('id', $data['id'])->update($data);

DELETE FROM `tbl_tamu`
WHERE `id` = '1'
---
    public function DeleteData($id)
    {
        $this->db->table('tbl_tamu')->where('id', $id)->delete();

SELECT COUNT(*) AS `numrows` FROM `tbl_tamu`
---
    public function getTotalTamu()
    {
        return $this->db->table($this->table)->countAll();

SELECT COUNT(*) AS `numrows`
FROM `tbl_tamu`
WHERE `jenis_kelamin` = 'Laki - Laki'
---
    public function getTotalLakiLaki()
    {
        return $this->db->table($this->table)->where('jenis_kelamin', 'Laki - Laki')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_tamu`
WHERE `jenis_kelamin` = 'Perempuan'
---
    public function getTotalPerempuan()
    {
        return $this->db->table($this->table)->where('jenis_kelamin', 'Perempuan')->countAllResults();

SELECT MONTH(terdaftar) as bulan, COUNT(*) as jumlah
FROM `tbl_tamu`
WHERE YEAR(terdaftar) = '2024'
GROUP BY MONTH(terdaftar)
---
    public function getTamuPerBulan($tahun)
    {
        // Mengambil jumlah tamu per bulan dalam tahun tertentu
        $data = $this->select('MONTH(terdaftar) as bulan, COUNT(*) as jumlah')
                     ->where('YEAR(terdaftar)', $tahun)
                     ->groupBy('MONTH(terdaftar)')
                     ->get()
                     ->getResultArray();