app/Models/UserModel.php

SELECT *
FROM `tbl_user`
WHERE `id` = '1'
---
    public function DetailData($id)
    {
        return $this->db->table('tbl_user')
            ->where('id', $id)
            ->get()->getRowArray();

UPDATE `tbl_user` SET `id` = '1', `nama` = 'Pengadilan Negeri Kisaran', `telpon` = '0623-4138932423', `username` = 'pengadilankisaran', `level` = 'Admin', `terdaftar` = '2024-09-19 10:59:35', `email` = 'mail@pn-kisaran.go.id', `password` = '$2y$10$S8AWzPATXm7VIMj4n9YcK.z3zEX.GGXe14iVhN1xzn4/q6ErQlp7e'
WHERE `id` = '1'
---
    public function UpdateData($data)
    {
        $this->db->table('tbl_user')->where('id', $data['id'])->update($data);

SELECT COUNT(*) AS `numrows` FROM `tbl_user`
---
    public function getTotalUser()
    {
        return $this->db->table('tbl_user')->countAll(); // Menghitung semua record dalam tabel